In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"personID":["1","2"],"lastName":["Wang","Alice"],"firstName":["Allen","BoB"]})

In [3]:
df1

  personID lastName firstName
0        1     Wang     Allen
1        2    Alice       BoB

In [5]:
df2 = pd.DataFrame({"addressID":["1","2"],"personID":["2","3"],"personID":["2","3"],"city":["new York","leetcode"],"state":["new york","california"]})

In [6]:
df2

  addressID personID      city       state
0         1        2  new York    new york
1         2        3  leetcode  california

In [10]:
# df3 = pd.merge(df2, left_on = 'personID',how = 'left')

In [ ]:
# df3 = pd.merge()

In [12]:
frames = [df1,df2]
result = pd.concat(frames)

In [13]:
result

  personID lastName firstName addressID      city       state
0        1     Wang     Allen       NaN       NaN         NaN
1        2    Alice       BoB       NaN       NaN         NaN
0        2      NaN       NaN         1  new York    new york
1        3      NaN       NaN         2  leetcode  california

In [18]:
final_ans = pd.merge(df1,df2, on = 'personID',how = 'left')

In [19]:
final_ans

  personID lastName firstName addressID      city     state
0        1     Wang     Allen       NaN       NaN       NaN
1        2    Alice       BoB         1  new York  new york

In [20]:
final_ans = pd.merge(df1,df2, on = 'personID',how = 'left')[['firstName','lastName','city','state']]

In [21]:
final_ans

  firstName lastName      city     state
0     Allen     Wang       NaN       NaN
1       BoB    Alice  new York  new york

In [29]:
# problem 2

In [32]:
df4 = pd.DataFrame({"id":["1","2","3","4","5","6","7"], "num":["1","1","1","2","1","2","2"]})

In [33]:
df4

  id num
0  1   1
1  2   1
2  3   1
3  4   2
4  5   1
5  6   2
6  7   2

In [38]:
#look at the no before and after each row 
df4['prev'] = df4['num'].shift(1) 
df4['next'] = df4['num'].shift(-1)



same_three = df4[(df4['num'] == df4['prev'] ) & (df4['num'] == df4['next'])]

result = same_three['num'].drop_duplicates()

final_2 = pd.DataFrame({'':result})

final_2

1  1

In [65]:
df5 = pd.DataFrame({"id":["1","2","3"],"salary":["100","200","300"]})

In [66]:
df5

  id salary
0  1    100
1  2    200
2  3    300

In [46]:
# second_highest = df5.sort_values(by = ['salary']).iloc[1]
# df5 = pd.DataFrame({"secondHighest":[second_highest]})
# df5

In [53]:
# df5 = pd.DataFrame({"secondHighest":[second_highest]})

In [64]:

unique_salaries = df5['salary'].sort_values(ascending=False)

second_highest = unique_salaries.iloc[1]

result = pd.DataFrame({'SecondHighestSalary': [second_highest]})

print(result)

  SecondHighestSalary
0                 200